###############################################################################
## @---	12/24/2012	Y.Ochi	Initial version                                  ##
###############################################################################

DEFAULT_ZOOM_LEVEL = 16
USER_ID = 47009             #Lenovo accout ID
INIT_LATITUDE = 35.457611    #MMC building
INIT_LONGTITUDE = 139.633296 #MMC building
BALLOON_OFFSET = -110

CATEGORY = {
  "カテゴリ"  : ".*"
  "和食"    : "和食|日本|寿司|ソバ|そば|蕎麦"
  "中華"    : "中華|ギョウザ|ラーメン"
  "韓国"    : "韓国|焼肉"
  "イタリアン" : "イタリアン|イタリア料理|パスタ|ピザ"
  "フレンチ"  : "フレンチ|フランス料理"
  "アメリカン" : "アメリカン|アメリカ料理|バーガー"
  "インド"   : "インド|カレー"
  "メキシカン" : "メキシカン"
  "タイ"     : "タイ"
  "カフェ"    : "カフェ|喫茶"
  "さっぱり"  : "さっぱり"
  "こってり"  : "こってり"
  "ヘルシー" : "ヘルシー"
  "ジャンク"  : "ジャンク"
}

DISTANCE = {
  "距離" : "Infinity"
  "100m以内" : "100"
  "200m以内" : "200"
  "300m以内" : "300"
  "400m以内" : "400"
  "500m以内" : "500"
  "600m以内" : "600"
}

ZOOM_LEVEL = {
  Infinity : DEFAULT_ZOOM_LEVEL
  100 : 18
  200 : 17
  300 : 16
  400 : 16
  500 : 15
  600 : 15
}

